// ConsoleSeaButtle.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
class Ship {
private:
    int size;
    bool status;
    int x, y; // начальные координаты, считаем от 0(слева направо)
    std::pair <int, int> pos;
   // char orientation_xOy; // x и y - координаты осей то есть. Нужна ли ориентация кораблся если у нас есть обе координаты? оставлю не реализованой пока
public:
    // блок сеттеров-геттеров
    void get_xy(std::pair <int, int> a)
    {
        x = a.first;
        y = a.second;
    }
    std::pair <int,int> set_xy()
    {
        return pos;
    }
    
    bool set_status()
    {
        return status;
    }
    
    void get_status(bool check)
    {
        status = check;
    }
   // 


};

class Board
{
private:
    std::pair <int, int> size_board = { 10,10 };//нужно ли мне?
    std::vector <Ship> ships_on_board;

public:

};


 /*  размещение кораблей инкапсулируем в класс Player, 
    Human_Player будет размещать их через ввод(позже реализуем действие с консолью при помощи кнопок)
    Ai_Player будет размещать корабли рандомно. 
        Методы выстрелов в Game? Хранение очков и по ним завершать? Или когда кол-во кораблей 0? Я за начисление очков
 */
class Game
{
private:
    bool check_win = false;

public:
    void Start_dialog()
    {
        std::cout << "Добро пожаловать в игру!" << std::endl << "Выберите противника: " <<
            std::endl << "BOT(Y)";
        char ans;
        std::cin >> ans;
        if (ans == 'Y') {
            std::cout << "Противник выбран. Игра началась!";
            // запуск отрисовки поля или выбора кораблей
        }
        else {
            std::cout << "Некорректный ввод, повторите";
            Start_dialog();
        }
    }
    void StartGame()
    {
        Start_dialog();
    }

};

class Player
{
private:

public:
};

class HumanPlayer : Player
{

};

class AiPlayer : Player
{

};





int main()
{
    Game new_round();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
